app/views/athletes/_form.html.erb

SELECT "physical_data".* FROM "physical_data" WHERE "physical_data"."athlete_id" = $1 ORDER BY "physical_data"."id" ASC LIMIT 1  [["athlete_id", 7]]
---
			<%= p.label :blood_group %>
			<%= p.select :blood_group, options_for_select(t('form.blood_group').invert, @athlete.physical_data.blood_group), {:include_blank => true }, {:class => 'combo-form-field'} %>

SELECT "technical_data".* FROM "technical_data" WHERE "technical_data"."athlete_id" = $1 ORDER BY "technical_data"."id" ASC LIMIT 1  [["athlete_id", 13]]
---
			<%= p.label :position %>
			<%= p.select :position, options_for_select(t('form.positions').invert, @athlete.technical_data.position), {:include_blank => true }, {:class => 'combo-form-field'} %>

SELECT "special_cares".* FROM "special_cares" WHERE "special_cares"."athlete_id" = $1 ORDER BY "special_cares"."id" ASC LIMIT 1  [["athlete_id", 13]]
---
			<%= p.label :relationship %>
			<%= p.select :relationship, options_for_select(t('form.relationships').invert, @athlete.special_care.relationship), {:include_blank => true }, {:class => 'combo-form-field'} %>