app/controllers/athletes_controller.rb

  def index
    @athletes = Athlete.all
---
SELECT "athletes".* FROM "athletes"

  def show
    @athlete = Athlete.find(params[:id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @athlete = Athlete.find(params[:id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT 1  [["id", "7"]]

  def create
    @athlete = Athlete.new(athlete_params)
    if @athlete.save
---
INSERT INTO "athletes" ("address", "birth_certificate", "birth_city", "birth_day", "birth_state", "book", "city", "college", "county", "cpf", "created_at", "ctps", "district", "driver_license", "email", "eyes", "facebook", "father_birth_day", "father_civil_status", "father_name", "father_phone_number", "father_profession", "full_name", "hair", "identification", "identification_agency", "mother_birth_day", "mother_civil_status", "mother_name", "mother_phone_number", "mother_profession", "mother_religion", "nick_name", "page", "phone_number", "religion", "reservist_registry", "responsible_birth_day", "responsible_name", "responsible_profession", "schooling", "skin", "state", "twitter", "updated_at", "voter_registry", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47) RETURNING "id"

  def update
    @athlete = Athlete.find(params[:id])
    if @athlete.update(athlete_params)
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "athletes" SET "birth_day" = $1, "updated_at" = $2 WHERE "athletes"."id" = 7  [["birth_day", Tue, 17 Sep 2013 03:00:00 BRT -03:00], ["updated_at", Fri, 03 Jan 2014 21:27:44 BRST -02:00]]