app/controllers/users_controller.rb

INSERT INTO "users" ("address", "admission_date", "city", "confirmation_token", "cpf", "created_at", "day_of_birth", "district", "email", "facebook", "full_name", "identification", "identification_agency", "password_digest", "profession", "registry", "twitter", "updated_at", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if @user.save